Revit 2027 API
Arc.Create(XYZ, XYZ, XYZ) Method
 Creates a new geometric arc object based on three points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Arc Create(
	XYZ end0,
	XYZ end1,
	XYZ pointOnArc
)
Public Shared Function Create (
	end0 As XYZ,
	end1 As XYZ,
	pointOnArc As XYZ
) As Arc
public:
static Arc^ Create(
	XYZ^ end0,
	XYZ^ end1,
	XYZ^ pointOnArc
)
static member Create :
        end0 : XYZ *
        end1 : XYZ *
        pointOnArc : XYZ -> Arc
Parameters
end0 XYZ
 The start point of the arc.
end1 XYZ
 The end point of the arc.
pointOnArc XYZ
 A point on the arc.
Return Value
Arc
 The new arc.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
ArgumentsInconsistentException |  The vectors end0 and end1 are coincident. -or- The vectors end0 and pointOnArc are coincident. -or- The vectors end1 and pointOnArc are coincident. -or- Cannot create an arc. -or- Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Example
// Create a new arc using two ends and a point on the curve
XYZ end0 = new XYZ(1, 0, 0);    // start point of the arc
XYZ end1 = new XYZ(10, 10, 10); // end point of the arc
XYZ pointOnCurve = new XYZ(10, 0, 0);   // point along arc
Arc arc = Arc.Create(end0, end1, pointOnCurve);
See Also
Reference
Arc Class
Create Overload
Autodesk.Revit.DB Namespace